Repository: Tusharr06/SYNERGYSIX
Catalog: FLUTTER-APP/agro_stick/lib/l10n/intl_*.arb
Languages: pa

# appTitle
source: Agrostick App
pa: ਐਗਰੋਸਟਿਕ ਐਪ

source: Profile
pa: ਪ੍ਰੋਫਾਈਲ

source: Personal Information
pa: ਨਿੱਜੀ ਜਾਣਕਾਰੀ

source: Name
pa: ਨਾਮ

source: Phone
pa: ਫ਼ੋਨ

source: Farm Name
pa: ਖੇਤ ਦਾ ਨਾਮ

source: Language
pa: ਭਾਸ਼ਾ

source: Save Profile
pa: ਪ੍ਰੋਫਾਈਲ ਸੰਭਾਲੋ

source: Logout
pa: ਲਾਗਆਉਟ

# profileUpdated
source: Profile updated successfully
pa: ਪ੍ਰੋਫਾਈਲ ਸਫਲਤਾਪੂਰਵਕ ਅਪਡੇਟ ਕੀਤੀ ਗਈ

# profileUpdateError
source: Error updating profile: {error}
pa: ਪ੍ਰੋਫਾਈਲ ਅਪਡੇਟ ਕਰਨ ਵਿੱਚ ਗਲਤੀ: {error}

source: Welcome!
pa: ਸਵਾਗਤ ਹੈ!

source: Hi
pa: ਸਤ ਸ੍ਰੀ ਅਕਾਲ

source: Weekly Weather
pa: ਹਫ਼ਤਾਵਾਰੀ ਮੌਸਮ

# fetchingWeather
source: Fetching 7-day weatherâ€¦
pa: 7-ਦਿਨਾਂ ਦਾ ਮੌਸਮ ਲੈ ਰਹੇ ਹਾਂ…

source: Weather unavailable
pa: ਮੌਸਮ ਜਾਣਕਾਰੀ ਉਪਲਬਧ ਨਹੀਂ

# espStatus
source: ESP32-S3 Status
pa: ESP32-S3 ਹਾਲਤ

source: Connected
pa: ਜੁੜਿਆ ਹੋਇਆ

source: Disconnected
pa: ਅਣਜੁੜਿਆ

source: Battery Level
pa: ਬੈਟਰੀ ਪੱਧਰ

source: Temperature
pa: ਤਾਪਮਾਨ

source: Spray Status
pa: ਸਪਰੇ ਹਾਲਤ

source: Idle
pa: ਨਿਸ਼ਕ੍ਰਿਆ

source: Spraying
pa: ਸਪਰੇ ਕਰ ਰਹੇ ਹਾਂ

source: Blogs
pa: ਬਲੌਗ

source: View All
pa: ਸਭ ਵੇਖੋ

source: Spray History
pa: ਸਪਰੇ ਇਤਿਹਾਸ

source: Today
pa: ਅੱਜ

source: This Week
pa: ਇਸ ਹਫ਼ਤੇ

source: This Month
pa: ਇਸ ਮਹੀਨੇ

source: Sprays
pa: ਸਪਰੇ

source: Spray Details
pa: ਸਪਰੇ ਵੇਰਵੇ

source: Spray Trend
pa: ਸਪਰੇ ਰੁਝਾਨ

source: Spray
pa: ਸਪਰੇ

source: Time
pa: ਸਮਾਂ

source: Amount
pa: ਮਾਤਰਾ

# liters
source: L
pa: ਲੀਟਰ

source: Spray {number}
pa: ਸਪਰੇ {number}

source: Crop Health
pa: ਫਸਲ ਸਿਹਤ

source: Farm Mapping
pa: ਖੇਤ ਨਕਸ਼ਾ

# farmMappingDescription
source: Map your farm boundary and detect disease locations with precision
pa: ਆਪਣੀ ਖੇਤ ਦੀ ਸੀਮਾ ਨੂੰ ਨਕਸ਼ੇ 'ਤੇ ਦਰਜ ਕਰੋ ਅਤੇ ਬੀਮਾਰੀ ਦੇ ਸਥਾਨਾਂ ਦਾ ਪਤਾ ਲਗਾਓ

source: Open Farm Mapping
pa: ਖੇਤ ਨਕਸ਼ਾ ਖੋਲ੍ਹੋ

# scanField
source: Scan Field for Accurate Results
pa: ਸਹੀ ਨਤੀਜਿਆਂ ਲਈ ਖੇਤ ਸਕੈਨ ਕਰੋ

# scanFieldDescription
source: Initiate a field scan to detect crop health issues with high accuracy
pa: ਫਸਲ ਸਿਹਤ ਸਮੱਸਿਆਵਾਂ ਦਾ ਪਤਾ ਲਗਾਉਣ ਲਈ ਖੇਤ ਸਕੈਨ ਸ਼ੁਰੂ ਕਰੋ

source: Field Scan
pa: ਖੇਤ ਸਕੈਨ

source: Loading model...
pa: ਮਾਡਲ ਲੋਡ ਹੋ ਰਿਹਾ ਹੈ...

source: Select Image Source
pa: ਚਿੱਤਰ ਸਰੋਤ ਚੁਣੋ

source: Camera
pa: ਕੈਮਰਾ

source: Gallery
pa: ਗੈਲਰੀ

source: Cancel
pa: ਰੱਦ ਕਰੋ

source: Quick Actions
pa: ਤੇਜ਼ ਕਾਰਵਾਈਆਂ

source: Start Spray
pa: ਸਪਰੇ ਸ਼ੁਰੂ ਕਰੋ

source: Stop Spray
pa: ਸਪਰੇ ਰੁਕੋ

source: Schedule Spray
pa: ਸਪਰੇ ਸ਼ਿਡਿਊਲ ਕਰੋ

source: Environmental Conditions
pa: ਪਰਿਬੇਸ਼ਕ ਸਥਿਤੀਆਂ

source: Humidity
pa: ਨਮੀ

source: Soil Condition
pa: ਮਿੱਟੀ ਦੀ ਹਾਲਤ

source: Optimal
pa: ਵਧੀਆ

source: Overall Infection Level
pa: ਕੁੱਲ ਸੰਕਰਮਣ ਪੱਧਰ

source: Crop Status
pa: ਫਸਲ ਹਾਲਤ

source: Healthy
pa: ਸਿਹਤਮੰਦ

source: Unhealthy
pa: ਅਸਿਹਤਮੰਦ

source: Treatment Recommendations
pa: ਇਲਾਜ ਸਿਫਾਰਸ਼ਾਂ

# basedOnCurrentInfection
source: Based on current infection level:
pa: ਮੌਜੂਦਾ ਸੰਕਰਮਣ ਪੱਧਰ ਦੇ ਅਧਾਰ 'ਤੇ:

# applyHighDosagePesticide
source: Apply high-dosage targeted pesticide
pa: ਉੱਚ-ਖੁਰਾਕ ਟਾਰਗੇਟ ਕੀਟਨਾਸ਼ਕ ਲਗਾਓ

# inspectAndMonitorDaily
source: Inspect and monitor daily for spread; re-scan in 24 hours
pa: ਫੈਲਣ ਲਈ ਰੋਜ਼ਾਨਾ ਜਾਂਚ ਕਰੋ; 24 ਘੰਟਿਆਂ ਵਿੱਚ ਦੁਬਾਰਾ ਸਕੈਨ ਕਰੋ

# removeAffectedLeaves
source: Remove heavily affected leaves; isolate diseased plants to limit spread
pa: ਭਾਰੀ ਪ੍ਰਭਾਵਿਤ ਪੱਤੇ ਹਟਾਓ; ਬੀਮਾਰ ਪੌਦਿਆਂ ਨੂੰ ਵੱਖ ਕਰੋ

source: Starting pesticide spray...
pa: ਕੀਟਨਾਸ਼ਕ ਸਪਰੇ ਸ਼ੁਰੂ ਹੋ ਰਿਹਾ ਹੈ...

source: Stopping pesticide spray...
pa: ਕੀਟਨਾਸ਼ਕ ਸਪਰੇ ਰੁਕ ਰਿਹਾ ਹੈ...

source: Opening spray schedule...
pa: ਸਪਰੇ ਸ਼ਿਡਿਊਲ ਖੋਲ੍ਹ ਰਹੇ ਹਾਂ...

# rateLimitedMessage
source: Rate limited. Please wait {seconds} seconds...
pa: ਰੇਟ ਸੀਮਿਤ। ਕਿਰਪਾ ਕਰਕੇ {seconds} ਸਕਿੰਟ ਰੁਕੋ...

# analyzingMessage
source: Analyzing...
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਕਰ ਰਹੇ ਹਾਂ...

# rateLimitedRetryMessage
source: Rate limited. Retrying in {seconds} seconds... ({attempt}/{maxRetries})
pa: ਰੇਟ ਸੀਮਿਤ। {seconds} ਸਕਿੰਟ ਵਿੱਚ ਫਿਰ ਕੋਸ਼ਿਸ਼ ਕਰ ਰਹੇ ਹਾਂ... ({attempt}/{maxRetries})

# analysisCompleteMessage
source: Analysis complete: {disease}
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਪੂਰਾ: {disease}

# analysisFailedMessage
source: Analysis failed: {error}
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਅਸਫਲ: {error}

source: Unknown disease detected
pa: ਅਗਿਆਤ ਬਿਮਾਰੀ ਦਾ ਪਤਾ ਲੱਗਾ

source: Could not parse AI response
pa: AI ਜਵਾਬ ਨੂੰ ਪਾਰਸ ਕਰਨ ਵਿੱਚ ਅਸਫਲ

source: Not Analyzed
pa: ਵਿਸ਼ਲੇਸ਼ਣ ਨਹੀਂ ਕੀਤਾ

# lowSeverity
source: Low
pa: ਘੱਟ

# mediumSeverity
source: Medium
pa: ਮੱਧਮ

# highSeverity
source: High
pa: ਉੱਚਾ

# applyPesticideFormat
source: Apply {pesticide} at {dosage}, {frequency}.
pa: {pesticide} ਨੂੰ {dosage} 'ਤੇ, {frequency}।

source: Detected
pa: ਪਤਾ ਲੱਗਾ

# pleaseWaitBeforeScanning
source: Please wait before scanning again
pa: ਕਿਰਪਾ ਕਰਕੇ ਸਕੈਨ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਉਡੀਕੋ

# invalidImageMessage
source: The uploaded image does not appear to be a crop leaf. Please upload a clear image of the leaf or crop.
pa: ਅਪਲੋਡ ਕੀਤੀ ਤਸਵੀਰ ਫਸਲ ਦੇ ਪੱਤੇ ਵਰਗੀ ਨਹੀਂ ਲੱਗਦੀ। ਕਿਰਪਾ ਕਰਕੇ ਪੱਤੇ ਜਾਂ ਫਸਲ ਦੀ ਸਾਫ਼ ਤਸਵੀਰ ਅਪਲੋਡ ਕਰੋ।

source: Try Again
pa: ਵਾਪਸ ਕੋਸ਼ਿਸ਼ ਕਰੋ
